//Напишите программу, которая на вход принимает два числа и выдает, какое число большее, 
//а какое меньшее

int a = -9;
int b = -3;
int max = a;
if (a < b) max = b;
Console.WriteLine(max);
